Documents/ЗаявкаНаДоставку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаявкаНаДоставку</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>авто_Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>авто_ГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>авто_Марка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>авто_Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>авто_ТелефонВодителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВодительЗаберетГрузСамостоятельно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Comment>Используется при программной проверке заполненности ОбработкаПроверкиЗаполнения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставленоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставленоОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУлицы</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемаяДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплачиваетПолучатель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаДоставку</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленEMail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленоОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставкиТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявокНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОтправленоСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УДАЛИТЬ_СтатусыДоставкиТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗатратНаДоставку</Name>
					<Comment>Себестоимость доставки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонКонтактногоЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срочно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспортногоСредства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПрикрепленныеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПрикрепленныеДанные</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Архивирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантАрхивации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыАрхивацииПрикрепленныхДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьАрхивации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАрхивации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФайлаGD</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПапкиGD</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидФайлаПрограммыПостроителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыФайловПрограммыПостроителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.УДАЛИТЬ_Замер</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаДоставку</v8:Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПрикрепленныеДанныеЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПрикрепленныеДанныеЭлектронныхПисем</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗаявкаНаДоставку/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда

	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СофтФонСервер.ПриСозданииНаСервере(ЭтотОбъект);
	МессенджерыСервер.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаКонтрагентКПМессенджеры);
	
	Элементы.ФормаОтправитьСМС.Видимость = Константы.АвтоматическаяРассылкаСМС.Получить();

	ОбновитьЭлементыФормы();
	ОбновитьИзображениеКомандОтправкиСообщений();
	
	// Видимость колонки Артикул
	ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма);
	
	// №10663
	ПолучитьИдентификаторГородаНаселенногоПункта();
	ВремАдресДоставки = Объект.АдресДоставки;
	ПроверитьНаличиеДанныхВКлассификатореАдресов();
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
	//ДоступныеТипы = Новый Массив;
	//ДоступныеТипы.Добавить("ДокументСсылка.ЗаказПокупателя");
	//ДоступныеТипы.Добавить("ДокументСсылка.РеализацияТоваровИУслуг");
	//Элементы.Основания.ПодчиненныеЭлементы.ОснованияОснование.ОграничениеТипа = Новый ОписаниеТипов(ДоступныеТипы);
	
	//nva+++
	ПредыдущаяОжидаемаяДатаОтправки = Объект.ОжидаемаяДатаОтправки;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ИсторияЗаявкиНаДоставку, "ЗаявкаНаДоставку", Объект.Ссылка, , , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	//nva---
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи) 
	
	Если Объект.ВидТранспортногоСредства.Пустая() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран ""Вид транспортного средства!""", Объект, "ВидТранспортногоСредства", "Объект.ВидТранспортногоСредства", Отказ);
	КонецЕсли;	
	
	Если НЕ Объект.Получатель.Пустая()
		И АдресДоставкиБылИзменен // №11868
		И НЕ АдресИмеетсяВКарточкеПолучателя() Тогда
		
		ПослеВопросаОДобавленииАдресаВКарточкуПолучателя = Новый ОписаниеОповещения("ПослеВопросаОДобавленииАдресаВКарточкуПолучателя", ЭтаФорма);
		ПоказатьВопрос(ПослеВопросаОДобавленииАдресаВКарточкуПолучателя, "Указанный в документе адрес отсутствует в карточке получателя. Добавить адрес в карточку?",РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
	Если НужноОтправитьУведомлениеEMail() Тогда
		Объект.ОтправленEMail = Истина;
		
		ПисьмоСНакладной = Ложь;
		Если Вопрос("Вложить печатную форму накладной в электронное письмо?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ПисьмоСНакладной = Истина;
		КонецЕсли;
		
		СсылкаНаЭлектронноеПисьмо = СформироватьЭлектронноеПисьмо(ПисьмоСНакладной);
		
		Парам = Новый Структура("Ключ",СсылкаНаЭлектронноеПисьмо);
		ОткрытьФорму("Документ.ЭлектронноеПисьмо.ФормаОбъекта",Парам);
	КонецЕсли;
	
	Если НужноОтправитьУведомлениеСМС() Тогда
		Если ОбщийМодульВызовСервера.ЕстьТелефонКонтрагента(Объект.Получатель) Тогда	
			Парам = Новый Структура;
			Парам.Вставить("Основание", Объект.Ссылка);
			ОткрытьФорму("Документ.ОтправкаСМС.Форма.ФормаДокумента",Парам,,,,,Новый ОписаниеОповещения("ПослеЗакрытияФормыНовогоСМС",ЭтаФорма));		
		Иначе
			ПоказатьОповещениеПользователя("У контрагента в карточке не указан номер телефона. СМС не создана");
		КонецЕсли;

	КонецЕсли;
	
	ОбновитьИзображениеКомандОтправкиСообщений();
	
	АдресДоставкиБылИзменен = Ложь; // №11868
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ПредыдущаяОжидаемаяДатаОтправки", ПредыдущаяОжидаемаяДатаОтправки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписьЗаявкиНаДоставку",, Объект.Ссылка); // №10663
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Города" И (Источник = Объект.Город ИЛИ Источник = Объект.ГородВыезда) Тогда		
		ПолучитьИдентификаторГородаНаселенногоПункта();		
		ПроверитьНаличиеДанныхВКлассификатореАдресов();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ВалютаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ГородПриИзменении(Элемент)
	
	ПолучитьИдентификаторГородаНаселенногоПункта();
	ПроверитьНаличиеДанныхВКлассификатореАдресов();
	//Объект.Адрес = ""; // выбрали другой город, очищаем адрес
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиПриИзменении(Элемент)
	
	ОбработкаСобытияАдресПриИзменении(Объект.АдресДоставки);	
	АдресДоставкиБылИзменен = Истина; // №11868
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыборАдресаИзСписка = Истина;
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьАдресаДоставкиКонтрагента();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	АдресДоставкиБылИзменен = Истина; // №11868
	
	Если НЕ ВыборАдресаИзСписка Тогда
		ОбщийМодульКлиент.ОбработкаСобытияАдресОбработкаВыбора(ЭтаФорма, Объект.АдресДоставки, Объект.ИдентификаторУлицы, ВремАдресДоставки, Элементы.АдресДоставки, "СдвинутьКурсорАдресаНаПоследнийСимвол", ВыбранноеЗначение, СтандартнаяОбработка);
	Иначе
		ВыборАдресаИзСписка = Ложь;
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
			СтандартнаяОбработка = Ложь;
			Объект.АдресДоставки = ВыбранноеЗначение.Представление;
			ОбработкаВыбораАдресаИзКлассификатораСервер(ВыбранноеЗначение.ЗначениеПолей, Объект.Город, Объект.АдресДоставки, ИдентификаторНаселенногоПункта);	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ОбщийМодульКлиент.ОбработкаСобытияАдресАвтоПодбор(ЭтаФорма, Объект.ИдентификаторУлицы, ИдентификаторНаселенногоПункта, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьИсходящийЗвонок(Команда)
	СофтфонКлиент.ВыполнитьИсходящийЗвонок(Команда, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда)
	МессенджерыКлиент.ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда, ЭтаФорма, Объект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьЭлементыФормы()
	
	Элементы.ГруппаАвтобус.Видимость = Ложь;
	Элементы.ГруппаТранспортнаяКомпания.Видимость = Ложь;
	Элементы.ГруппаСобственныйТранспорт.Видимость = Ложь;
	
	Если Объект.СпособДоставки = Справочники.СпособыДоставкиТовара.ТранспортнаяКомпания Тогда
		Элементы.ГруппаТранспортнаяКомпания.Видимость = Истина;
	ИначеЕсли Объект.СпособДоставки = Справочники.СпособыДоставкиТовара.СобственныйТранспорт Тогда
		Элементы.ГруппаСобственныйТранспорт.Видимость = Истина;
	ИначеЕсли Объект.СпособДоставки = Справочники.СпособыДоставкиТовара.Автобус или Объект.СпособДоставки = Справочники.СпособыДоставкиТовара.ПопутныйАвтомобиль Тогда
		Элементы.ГруппаАвтобус.Видимость = Истина;
	КонецЕсли;
	
	ОбновитьСписокФайлов();
	
	//nva+++ 
	Элементы.Декорация2.Заголовок = Формат(НачалоЧаса(Объект.ОжидаемаяДатаДоставки) + 3600, "ДФ=HH:mm");
	//nva---
	//Если Объект.Товары.Количество() > 0 Тогда
	//	Элементы.ГруппаТовары.Заголовок = "Товары (" + Объект.Товары.Количество() + ")";
	//Иначе
	//	Элементы.ГруппаТовары.Заголовок = "Товары";
	//КонецЕсли;
	
	//Элементы.КонтрагентДополнительно.Видимость = Объект.Получатель.ПоказыватьДопИнформацию;
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Получатель, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Получатель, Элементы.ПоказатьДополнительнуюИнформацию);
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = ОбщийМодульВызовСервера.ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	СтрокаТабличнойЧасти.Количество = 1;
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайл(Команда)	
	Если Объект.Ссылка.Пустая() Тогда
		//показываем что необходимо записать перед добавление файла 
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОСохранении", ЭтотОбъект);
		
		ПоказатьВопрос(Оповещение, "Перед добавление файлов необходимо сохранить документ, сохранить документ?", РежимДиалогаВопрос.ДаНет);			
	Иначе
		//выводим диалог выбора файла
		ПрикрепитьФайлКДокументу();
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОСохранении(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Записать();
		ПрикрепитьФайлКДокументу();
	КонецЕсли;	
КонецПроцедуры
	
&НаКлиенте
Процедура ПрикрепитьФайлКДокументу()
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПрикрепленияФайлаЗавершение", ЭтотОбъект);
	ДопПараметры = Новый Структура("ДействиеПослеПрикрепления", ОписаниеОповещения);
	ОбщийМодульКлиент.ПослеВыбораСсылкиДляПрикрепленияФайла(Объект.Ссылка, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПрикрепленияФайлаЗавершение(СтруктураРезультата, ДополнительныеПараметры) Экспорт
	
	Если СтруктураРезультата.Результат Тогда
		ОбновитьЭлементыФормы();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьФайл(Команда)
	
	ВыбранныеЭлементы = Элементы.Файлы.ВыделенныеСтроки;
	
	Если ВыбранныеЭлементы.Количество() > 0 Тогда
		Для каждого ЭлементДляПечати из ВыбранныеЭлементы Цикл
			СтрФайл = Файлы.НайтиПоИдентификатору(ЭлементДляПечати);
			//Если СтрФайл.Номенклатура.Пустая() Тогда
				АдресФайла = ПолучитьДанные(Объект.Ссылка, СтрФайл.ИмяФайла);
			//Иначе
			//	АдресФайла = ПолучитьДанные(СтрФайл.Номенклатура, СтрФайл.ИмяФайла);
			//КонецЕсли;
			
			ВременноеИмя = ПолучитьИмяВременногоФайла(СтрФайл.Расширение);
			ПолучитьФайл(АдресФайла, ВременноеИмя, Ложь);
			
			Shell = Новый COMОбъект("Shell.Application");
			Shell.ShellExecute(ВременноеИмя, "", "", "print", 0);
		КонецЦикла;
	Иначе
		ПоказатьПредупреждение(,"Выберите файл(ы) в списке");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОформитьПоступлениеТоваровИУслуг(Команда)
	ПараметрыНовойФормы = Новый Структура;
	ПараметрыНовойФормы.Вставить("Основание",Объект.Ссылка);
	ОткрытьФорму("Документ.ПоступлениеТоваровИУслуг.Форма.ФормаДокумента",ПараметрыНовойФормы);
КонецПроцедуры

&НаКлиенте
Процедура ОформитьРасходныйКассовыйОрдер(Команда)
	ПараметрыНовойФормы = Новый Структура;
	ПараметрыНовойФормы.Вставить("Основание",Объект.Ссылка);
	ОткрытьФорму("Документ.РасходныйКассовыйОрдер.Форма.ФормаДокумента",ПараметрыНовойФормы);
КонецПроцедуры

&НаКлиенте
Процедура ОформитьПриходныйКассовыйОрдер(Команда)
	ПараметрыНовойФормы = Новый Структура;
	ПараметрыНовойФормы.Вставить("Основание", Объект.Ссылка);
	ОткрытьФорму("Документ.ПриходныйКассовыйОрдер.Форма.ФормаДокумента", ПараметрыНовойФормы);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоПочте(Команда)
	Если Вопрос("Создать новое электронное письмо?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ПисьмоСНакладной = Ложь;
		Если Вопрос("Вложить печатную форму накладной в электронное письмо?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ПисьмоСНакладной = Истина;
		КонецЕсли;
		
		Объект.ОтправленEMail = Истина;
		Модифицированность = Истина;
		
		СсылкаНаЭлектронноеПисьмо = СформироватьЭлектронноеПисьмо(ПисьмоСНакладной);		
		Парам = Новый Структура("Ключ",СсылкаНаЭлектронноеПисьмо);
		ОткрытьФорму("Документ.ЭлектронноеПисьмо.ФормаОбъекта",Парам);		
	КонецЕсли;
	ОбновитьИзображениеКомандОтправкиСообщений();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСМС(Команда)
	Если ОбщийМодульВызовСервера.ЕстьТелефонКонтрагента(Объект.Получатель) Тогда	
		Парам = Новый Структура;
		Парам.Вставить("Основание", Объект.Ссылка);
		ОткрытьФорму("Документ.ОтправкаСМС.Форма.ФормаДокумента",Парам,,,,,Новый ОписаниеОповещения("ПослеЗакрытияФормыНовогоСМС",ЭтаФорма));		
	Иначе
		ПоказатьОповещениеПользователя("У получателя в карточке не указан номер телефона. СМС не создана");
	КонецЕсли;
	ОбновитьИзображениеКомандОтправкиСообщений();
КонецПроцедуры

&НаСервере
Функция СформироватьЭлектронноеПисьмо(ПисьмоСНакладной = Ложь)
	
	//создаем письмо
	Если ПисьмоСНакладной И НЕ Объект.Ссылка.Пустая() Тогда	
		МассивДокументов = Новый Массив;
		МассивДокументов.Добавить(Объект.Ссылка);
		ОбъектыПечати = Новый СписокЗначений;
		ПечатнаяФормаНакладной = Документы.ЗаявкаНаДоставку.ПечатьНакладнаяНаДоставку(МассивДокументов, ОбъектыПечати);
		НовоеПисьмо = РаботаСЭлектроннойПочтой.СформироватьЭлектронноеПисьмоСОтчетом(ПечатнаяФормаНакладной, "Доставка товара", Объект.Получатель, "pdf");
	Иначе
		НовоеПисьмо = РаботаСЭлектроннойПочтой.СформироватьЭлектронноеПисьмо("Доставка товара", Объект.Получатель);
	КонецЕсли;		

	//прикрепляем к нему вложенные к заявке файлы
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрикрепленныеДанныеСрезПоследних.Период,
	|	ПрикрепленныеДанныеСрезПоследних.СсылкаНаОбъект,
	|	ПрикрепленныеДанныеСрезПоследних.ИмяФайла,
	|	ПрикрепленныеДанныеСрезПоследних.Данные,
	|	ПрикрепленныеДанныеСрезПоследних.Расширение
	|ИЗ
	|	РегистрСведений.ПрикрепленныеДанные.СрезПоследних(, СсылкаНаОбъект = &СсылкаНаОбъект) КАК ПрикрепленныеДанныеСрезПоследних";
	Запрос.УстановитьПараметр("СсылкаНаОбъект",Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.ПрикрепленныеДанныеЭлектронныхПисем.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекущаяДатаСеанса();
		МенеджерЗаписи.Данные = Выборка.Данные;
		МенеджерЗаписи.ИмяФайла = Выборка.ИмяФайла;
		МенеджерЗаписи.Расширение = Выборка.Расширение;
		МенеджерЗаписи.СсылкаНаОбъект = НовоеПисьмо;
		МенеджерЗаписи.Записать(Ложь);
	КонецЦикла;
	
	Возврат НовоеПисьмо;
	
КонецФункции

&НаСервере
Функция НужноОтправитьУведомлениеEMail()
	
	Если Объект.Результат = Справочники.СтатусыЗаявокНаДоставку.Отправлено Тогда // №10663 заменено на справочник, было: Перечисления.СтатусыДоставкиТовара.ВПути
		Если Константы.ДоставкаОтправлятьЕмайл.Получить() и НЕ Объект.ОтправленEMail Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция НужноОтправитьУведомлениеСМС()
	
	Если Объект.Результат = Справочники.СтатусыЗаявокНаДоставку.Отправлено Тогда // №10663 заменено на справочник, было: Перечисления.СтатусыДоставкиТовара.ВПути
		Если Константы.ДоставкаОтправлятьСМС.Получить() и НЕ ОтправленоСМС и РаботаССМС.ОтправлятьСМСКонтрагенту(Объект.Получатель) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция АдресИмеетсяВКарточкеПолучателя()
	
	Результат = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.АдресДоставки) Тогда
		Возврат Истина;
	КонецЕсли;
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Объект.Получатель);
	
	КонтактнаяИнформацияОбъекта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивОбъектов,, Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);
	
	Если КонтактнаяИнформацияОбъекта.Количество() = 0 Тогда
		Возврат Результат; 
	КонецЕсли;

	ПредставлениеАдреса = ПредставлениеАдреса(Объект.Город, Объект.АдресДоставки);
	
	Для Каждого ЭлементАдресаДоставки Из КонтактнаяИнформацияОбъекта Цикл
		Если СтрНайти(СокрЛП(ЭлементАдресаДоставки.Представление), ПредставлениеАдреса) > 0 Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//&НаСервере
//Функция КоличествоАдресовВКарточкеПлучателя()
//	Возврат Объект.Получатель.АдресаДоставки.Количество();
//КонецФункции

&НаСервере
Процедура ПослеВопросаОДобавленииАдресаВКарточкуПолучателяНаСервере()
	
	//ЭтоПервыйАдрес = КоличествоАдресовВКарточкеПлучателя() = 0;
	
	ПолучательОбъект = Объект.Получатель.ПолучитьОбъект();
	//НоваяСтрока = ПолучательОбъект.АдресаДоставки.Добавить();
	//НоваяСтрока.Адрес = Объект.АдресДоставки;
	//НоваяСтрока.Основной = ЭтоПервыйАдрес;
	ВидИнформации = Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента;
	ТипИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес;	
	ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(ПредставлениеАдреса(Объект.Город, Объект.АдресДоставки), ВидИнформации);
	УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ПолучательОбъект, ЗначенияПолей, ВидИнформации, ТипИнформации);
				
	Попытка
		ПолучательОбъект.Записать();
	Исключение
		Сообщить("Не удалось добавить адрес в карточку " + Объект.Получатель + ". " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОДобавленииАдресаВКарточкуПолучателя(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПослеВопросаОДобавленииАдресаВКарточкуПолучателяНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресаДоставкиКонтрагента()
	
	Результат = Новый СписокЗначений;
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Объект.Получатель);
	
	КонтактнаяИнформацияОбъекта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивОбъектов,, Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);
	
	Для Каждого СтрокаАдреса Из КонтактнаяИнформацияОбъекта Цикл
		Результат.Добавить(Новый Структура("ЗначениеПолей, Представление", СтрокаАдреса.Значение, СтрокаАдреса.Представление), СтрокаАдреса.Представление);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПолучательПриИзмененииНаСервере()
	//Если Объект.Получатель.АдресаДоставки.Количество() = 1 Тогда
	//	Объект.АдресДоставки = Объект.Получатель.АдресаДоставки[0].Адрес;
	//Иначе
	//	Для Каждого СтрокаАдреса Из Объект.Получатель.АдресаДоставки Цикл
	//		Если СтрокаАдреса.Основной Тогда
	//			Объект.АдресДоставки = СтрокаАдреса.Адрес;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	
	Объект.АдресДоставки = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Получатель, Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);		
	//Элементы.КонтрагентДополнительно.Видимость = Объект.Получатель.ПоказыватьДопИнформацию;
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Получатель, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Получатель, Элементы.ПоказатьДополнительнуюИнформацию);
	
	АдресДоставкиБылИзменен = Истина; // №11868
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	ПолучательПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СпособДоставкиПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодобратьАвтомобиль(Команда)
	ВыбранныйАвтомобиль = ПолучитьФорму("Справочник.ТранспортныеСредства.ФормаВыбора").ОткрытьМодально();
	Если НЕ ВыбранныйАвтомобиль = Неопределено Тогда
		КомандаПодобратьАвтомобильНаСервере(ВыбранныйАвтомобиль);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КомандаПодобратьАвтомобильНаСервере(ВыбранныйАвтомобиль)
	
	Объект.авто_Водитель = ВыбранныйАвтомобиль.Водитель;
	Объект.авто_ГосНомер = ВыбранныйАвтомобиль.ГосНомер;
	Объект.авто_Марка = ВыбранныйАвтомобиль.Марка;
	Объект.авто_Модель = ВыбранныйАвтомобиль.Модель;
	Объект.авто_ТелефонВодителя = ВыбранныйАвтомобиль.ТелефонВодителя;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокФайлов()
	
	Файлы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрикрепленныеДанные.ИмяФайла,
	|	ПрикрепленныеДанные.Расширение,
	|	ПрикрепленныеДанные.ИмяФайла + ""."" + ПрикрепленныеДанные.Расширение КАК НаименованиеФайла,
	|	ПрикрепленныеДанные.Период КАК ДатаПрикрепления
	|ИЗ
	|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные
	|ГДЕ
	|	ПрикрепленныеДанные.СсылкаНаОбъект В(&СсылкаНаОбъект)";
	Запрос.УстановитьПараметр("СсылкаНаОбъект", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Файлы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	Если Файлы.Количество() > 0 Тогда
		Элементы.ТаблицаФайлы.Заголовок = "Файлы (" + Файлы.Количество() + ")";
	Иначе
		Элементы.ТаблицаФайлы.Заголовок = "Файлы";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанные(СсылкаНаОбъект, ИмяФайла)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрикрепленныеДанные.Данные
	|ИЗ
	|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные
	|ГДЕ
	|	ПрикрепленныеДанные.СсылкаНаОбъект = &Ссылка
	|	И ПрикрепленныеДанные.ИмяФайла = &ИмяФайла";
	Запрос.УстановитьПараметр("Ссылка",СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ИмяФайла",ИмяФайла);
	
	
	Данные = Неопределено;
	Выборка = Запрос.Выполнить().Выгрузить();
	Если Выборка.Количество() > 0 тогда
		Данные = Выборка[0].Данные.Получить();
	КонецЕсли;
	 
	Возврат ПоместитьВоВременноеХранилище(Данные, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Функция ПолучитьИмяВременногоФайлаСерв(Расширение)
	Возврат ПолучитьИмяВременногоФайла(Расширение);
КонецФункции

&НаКлиенте
Процедура ФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	АдресФайла = ПолучитьДанные(Объект.Ссылка, Элементы.Файлы.ТекущиеДанные.ИмяФайла);
	ВременноеИмя=ПолучитьИмяВременногоФайлаСерв(Элементы.Файлы.ТекущиеДанные.Расширение);
    ПолучитьФайл(АдресФайла, ВременноеИмя, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ТекущийСтатусПриИзмененииНаСервере()
	
	Если Объект.Результат = Справочники.СтатусыЗаявокНаДоставку.Отправлено Тогда // №10663 заменено на справочник, было: Перечисления.СтатусыДоставкиТовара.ВПути
		Объект.ОтправленоДата = ТекущаяДатаСеанса();
		Объект.ОтправленоОтветственный = Пользователи.ТекущийПользователь();
	ИначеЕсли Объект.Результат = Справочники.СтатусыЗаявокНаДоставку.Доставлено Тогда // №10663 заменено на справочник, было: Перечисления.СтатусыДоставкиТовара.Доставлено Тогда
		Объект.ДоставленоДата = ТекущаяДатаСеанса();
		Объект.ДоставленоОтветственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийСтатусПриИзменении(Элемент)
	ТекущийСтатусПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьИзображениеКомандОтправкиСообщений()
	Если Объект.ОтправленEMail Тогда
		ЭтаФорма.Элементы.ФормаОтправитьПоПочте.Картинка = БиблиотекаКартинок.ОтправленоПисьмо;
	КонецЕсли;
	
	//СМС
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтправкаСМС.Ссылка,
	|	1 КАК Создано,
	|	ВЫБОР
	|		КОГДА ОтправкаСМС.Отправлено
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Отправлено
	|ИЗ
	|	Документ.ОтправкаСМС КАК ОтправкаСМС
	|ГДЕ
	|	ОтправкаСМС.Основание = &Основание";
	Запрос.УстановитьПараметр("Основание", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Если РезультатЗапроса.Количество() > 0 Тогда
		РезультатЗапроса.Свернуть("","Создано, Отправлено");
	КонецЕсли;
	
	Если РезультатЗапроса.Количество() = 0 Тогда
		Элементы.ФормаОтправитьСМС.Картинка = БиблиотекаКартинок.ОтправитьSMS;
	Иначе
		Если РезультатЗапроса[0].Отправлено >= РезультатЗапроса[0].Создано Тогда
			Элементы.ФормаОтправитьСМС.Картинка = БиблиотекаКартинок.ОтправленоСМС;
			ОтправленоСМС = Истина;
		Иначе
			Элементы.ФормаОтправитьСМС.Картинка = БиблиотекаКартинок.ПриготовленоСМС;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыНовогоСМС(РезультатЗакрытия, ДополнительныеПараметры)Экспорт
	ОбновитьИзображениеКомандОтправкиСообщений();
КонецПроцедуры

//++ №10663
&НаСервере
Процедура ПолучитьИдентификаторГородаНаселенногоПункта()
	
	ИдентификаторНаселенногоПункта = ОбщийМодульСервер.ИдентификаторГородаНаселенногоПункта(Объект.Город);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьАдрес(Команда)
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторНаселенногоПункта) Тогда
		ПредставлениеАдресаДоставки = Объект.АдресДоставки;			
	Иначе
		ПредставлениеАдресаДоставки = ПредставлениеАдреса(Объект.Город, Объект.АдресДоставки);
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораАдресаФИАС", ЭтотОбъект);
	ПараметрыАдреса = Новый Структура;
	ПараметрыАдреса.Вставить("Представление", ПредставлениеАдресаДоставки);
	ПараметрыАдреса.Вставить("ОткрытаПоСценарию", Истина);
	ПараметрыАдреса.Вставить("ВидКонтактнойИнформации", Новый Структура("ПроверятьКорректность", Ложь));

	ОткрытьФорму("Обработка.РасширенныйВводКонтактнойИнформации.Форма.ВводАдреса",ПараметрыАдреса,ЭтаФорма,,,,ОписаниеОповещения);
	Модифицированность = Истина;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредставлениеАдреса(Город, Адрес)
	
	Возврат ОбщийМодульСервер.ПредставлениеАдреса(Город, Адрес);
	
КонецФункции

&НаСервере
Процедура ПроверитьНаличиеДанныхВКлассификатореАдресов()
	
	Элементы.ДекорацияКлассификаторНеЗагружен.Видимость = Ложь;
	Элементы.ДекорацияКлассификаторНеЗагружен.Подсказка = "";
	
	//проверим наличие городов	
	Если НЕ ОбщийМодульСервер.ЕстьГородаВСправочнике() Тогда
		Элементы.ДекорацияКлассификаторНеЗагружен.Видимость = Истина;
		Элементы.ДекорацияКлассификаторНеЗагружен.Подсказка = Элементы.ДекорацияКлассификаторНеЗагружен.Подсказка + "В справочнике городов нет ни одного города" + Символы.ПС;
	КонецЕсли;
	
	//проверим наличие данных в классификаторе адресов
	Если ЗначениеЗаполнено(Объект.Город) Тогда
		Если НЕ ЗначениеЗаполнено(ИдентификаторНаселенногоПункта) Тогда
			Элементы.ДекорацияКлассификаторНеЗагружен.Видимость = Истина;		
			Элементы.ДекорацияКлассификаторНеЗагружен.Подсказка = Элементы.ДекорацияКлассификаторНеЗагружен.Подсказка + "В карточке города не указан код КЛАДР или не загружены данные по городу" + Символы.ПС;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораАдресаФИАС(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеВыбора.ВведеноВСвободнойФорме Тогда 
		Объект.АдресДоставки = ЗначениеВыбора.Представление;
	ИначеЕсли НЕ ЗначениеЗаполнено(ИдентификаторНаселенногоПункта) Тогда
		Объект.АдресДоставки = ОбщийМодульКлиентСервер.УбратьИндексВАдресе(ЗначениеВыбора.Представление);
		ОБъект.Город = ПредопределенноеЗначение("Справочник.Города.ПустаяСсылка");
	Иначе
		ОбработкаВыбораАдресаИзКлассификатораСервер(ЗначениеВыбора.Значение, 
													Объект.Город, Объект.АдресДоставки, ИдентификаторНаселенногоПункта);
	КонецЕсли;
	
	ОбработкаСобытияАдресПриИзменении(Объект.АдресДоставки);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбработкаВыбораАдресаИзКлассификатораСервер(АдресJSON, Город, Адрес, ИдентификаторНаселенногоПункта)

	ОбщийМодульСервер.ОбработкаВыбораАдресаИзКлассификатора(АдресJSON, Город, Адрес, ИдентификаторНаселенногоПункта);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаСобытияАдресПриИзменении(Адрес)
		
	Если ПустаяСтрока(Адрес) Тогда
		Объект.ИдентификаторУлицы = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьКурсорАдресаНаПоследнийСимвол() Экспорт
	
	Элементы.АдресДоставки.ВыделенныйТекст = Объект.АдресДоставки;
	ПозицияОкончания = СтрДлина(Объект.АдресДоставки)+1;
	Элементы.АдресДоставки.УстановитьГраницыВыделения(ПозицияОкончания, ПозицияОкончания);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТоварыПоОснованиям(Команда)
	
	Если Объект.Товары.Количество() > 0 Тогда
		ПоказатьВопросОбОчищенииТабличнойЧастиТоварыПриЗаполнении();
	Иначе
		ЗаполнитьТоварыПоОснованиямНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросОбОчищенииТабличнойЧастиТоварыПриЗаполнении()
	
	ОП = Новый ОписаниеОповещения("ПослеВопросаОбОчищенииТабличнойЧастиТоварыПриЗаполнении", ЭтотОбъект);
	ПоказатьВопрос(ОП, "В табличной части ""Товары"" присутствуют позиции, табличная часть будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчищенииТабличнойЧастиТоварыПриЗаполнении(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТоварыПоОснованиямНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыПоОснованиямНаСервере()
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	РеквизитОбъект.ЗаполнитьТоварыПоОснованиям();
	ЗначениеВРеквизитФормы(РеквизитОбъект, "Объект");
	
	Модифицированность = Истина;
	
КонецПроцедуры
//-- №10663

&НаКлиенте
Процедура ПоказатьДополнительнуюИнформацию(Команда)
	
	ОбщийМодульКлиент.ФормаДополнительнойИнформацииКонтрагента(Объект.Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованияПриАктивизацииЯчейки(Элемент)
	Если Элемент.ТекущийЭлемент.Имя = "ОснованияОснование" Тогда
		
		МассивОтбора = Новый Массив;
			МассивОтбора.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
			МассивОтбора.Добавить(Тип("ДокументСсылка.РеализацияТоваровИУслуг")); 
			МассивОтбора.Добавить(Тип("ДокументСсылка.ЗаказПоставщику"));
			ДопустимыеТипы = Новый ОписаниеТипов(МассивОтбора);
			
		Элемент.ТекущийЭлемент.ОграничениеТипа = ДопустимыеТипы;
		
	КонецЕсли;
	
КонецПроцедуры

//nva+++
&НаКлиенте
Процедура ОжидаемаяДатаДоставкиПриИзменении(Элемент)
	Объект.ОжидаемаяДатаОтправки = Объект.ОжидаемаяДатаДоставки - 60*60;	
КонецПроцедуры

&НаКлиенте
Процедура ОжидаемаяДатаДоставки1ПриИзменении(Элемент)
	Если НачалоДня(Объект.ОжидаемаяДатаДоставки) + 3600*8 < НачалоЧаса(Объект.ОжидаемаяДатаДоставки) Тогда
		Элементы.Декорация2.Заголовок = Формат(НачалоЧаса(Объект.ОжидаемаяДатаДоставки) + 3600, "ДФ=HH:mm");
	Иначе
		Объект.ОжидаемаяДатаДоставки = НачалоДня(Объект.ОжидаемаяДатаДоставки) + 3600*8;
		Элементы.Декорация2.Заголовок = Формат(НачалоЧаса(Объект.ОжидаемаяДатаДоставки) + 3600, "ДФ=HH:mm");
	КонецЕсли;	
КонецПроцедуры
//nva---
